# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'bat'
brew 'ffmpeg'
brew 'git'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'fzf'
brew 'yt-dlp'

# Apps
cask 'iterm2'
cask 'alt-tab'
cask 'linearmouse'
cask 'firefox'
cask 'google-chrome'
cask 'itsycal'
cask 'flycut'
cask 'the-unarchiver'
cask 'linearmouse'

# Mac App Store
mas 'Boop', id: 1518425043
